//######################################################################
//###########################           SSTech       ###################
//###########################   Programming Courses  ###################
//######################################################################
let said, said2: number;
said = parseInt(prompt('العدد الاول'));
said2 = parseInt(prompt('العدد الثاني'));
if (said * said2 == 0) {
  console.log('العدد معدوم');
} else if (said * said2 > 0) {
  console.log('االنتيجة موجبة');
} else {
  console.log('النتيجة سالب');
}
